lvx/extension/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
	</Catalog>
</MetaDataObject>

lvx/extension/InformationRegisters/бит_СтруктурыХраненияУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтруктурыХраненияУпаковок</Name>
			<Comment>ЛТ6.3 [Микляев К.А.]</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержимоеУпаковкиПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МассаКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМ3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВсегоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/extension/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.2]  [VUVaynula@1cbit.ru] [14.05.2026 16:09:14] +        
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_КатегорийныйМатериал", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаОсновныеПараметрыУчета);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КатегорийныйМатериал";
	// }}ПервыйБИТ ЛистТребований [ЛТ2.2]  [VUVaynula@1cbit.ru] [14.05.2026 16:09:14] -
   		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.3] [Микляев К.А.] [03.06.2026] +
	бит_СоздатьСтраницуСтруктурыХраненияУпаковок();
	бит_ОбновитьСтруктурыХраненияУпаковокНаСервере();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.3] [Микляев К.А.] [03.06.2026] -

КонецПроцедуры


&НаСервере
Процедура бит_СоздатьСтраницуСтруктурыХраненияУпаковок()
	
	Если Элементы.Найти("СтраницыКарточкаНоменклатуры") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти("бит_СтраницаСтруктурыХраненияУпаковок") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("бит_СтруктурыХраненияУпаковок", Новый ОписаниеТипов("ТаблицаЗначений")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("НомерУпаковки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ВсегоУпаковок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("СодержимоеУпаковкиПФ", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ДлинаМм", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ШиринаМм", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ВысотаМм", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("МассаКг", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ОбъемМ3", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "бит_СтруктурыХраненияУпаковок"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("бит_ИтогоМассаКг", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3))));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("бит_ИтогоОбъемМ3", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3))));
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Страница = Элементы.Добавить("бит_СтраницаСтруктурыХраненияУпаковок", Тип("ГруппаФормы"), Элементы.СтраницыКарточкаНоменклатуры);
	Страница.Вид = ВидГруппыФормы.Страница;
	Страница.Заголовок = "Структура хранения упаковок";
	
	ГруппаКоманд = Элементы.Добавить("бит_ГруппаКомандСтруктурыХраненияУпаковок", Тип("ГруппаФормы"), Страница);
	ГруппаКоманд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКоманд.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКоманд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	Таблица = Элементы.Добавить("бит_СтруктурыХраненияУпаковок", Тип("ТаблицаФормы"), Страница);
	Таблица.ПутьКДанным = "бит_СтруктурыХраненияУпаковок";
	Таблица.Отображение = ОтображениеТаблицы.Список;
	Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокНомерУпаковки", "бит_СтруктурыХраненияУпаковок.НомерУпаковки", "Номер упаковки");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокВсегоУпаковок", "бит_СтруктурыХраненияУпаковок.ВсегоУпаковок", "Всего упаковок");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокСодержимоеУпаковкиПФ", "бит_СтруктурыХраненияУпаковок.СодержимоеУпаковкиПФ", "Содержимое упаковки п/ф");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокДлинаМм", "бит_СтруктурыХраненияУпаковок.ДлинаМм", "Длина, мм");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокШиринаМм", "бит_СтруктурыХраненияУпаковок.ШиринаМм", "Ширина, мм");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокВысотаМм", "бит_СтруктурыХраненияУпаковок.ВысотаМм", "Высота, мм");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокМассаКг", "бит_СтруктурыХраненияУпаковок.МассаКг", "Масса, кг");
	бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, "бит_СтруктурыХраненияУпаковокОбъемМ3", "бит_СтруктурыХраненияУпаковок.ОбъемМ3", "Объем, м3");
	
	Команда = Команды.Добавить("бит_ОбновитьСтруктурыХраненияУпаковок");
	Команда.Заголовок = "Обновить";
	Команда.Действие = "бит_ОбновитьСтруктурыХраненияУпаковок";
	Кнопка = Элементы.Добавить("бит_ОбновитьСтруктурыХраненияУпаковок", Тип("КнопкаФормы"), ГруппаКоманд);
	Кнопка.ИмяКоманды = "бит_ОбновитьСтруктурыХраненияУпаковок";
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_СтруктурыХраненияУпаковок) Тогда
		Команда = Команды.Добавить("бит_СоздатьСтруктуруХраненияУпаковок");
		Команда.Заголовок = "Создать";
		Команда.Действие = "бит_СоздатьСтруктуруХраненияУпаковок";
		Кнопка = Элементы.Добавить("бит_СоздатьСтруктуруХраненияУпаковок", Тип("КнопкаФормы"), ГруппаКоманд);
		Кнопка.ИмяКоманды = "бит_СоздатьСтруктуруХраненияУпаковок";
		
		Команда = Команды.Добавить("бит_ИзменитьСтруктуруХраненияУпаковок");
		Команда.Заголовок = "Изменить";
		Команда.Действие = "бит_ИзменитьСтруктуруХраненияУпаковок";
		Кнопка = Элементы.Добавить("бит_ИзменитьСтруктуруХраненияУпаковок", Тип("КнопкаФормы"), ГруппаКоманд);
		Кнопка.ИмяКоманды = "бит_ИзменитьСтруктуруХраненияУпаковок";
	КонецЕсли;
	
	ГруппаИтогов = Элементы.Добавить("бит_ГруппаИтоговСтруктурыХраненияУпаковок", Тип("ГруппаФормы"), Страница);
	ГруппаИтогов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИтогов.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаИтогов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	ПолеИтогоМасса = Элементы.Добавить("бит_ИтогоМассаКг", Тип("ПолеФормы"), ГруппаИтогов);
	ПолеИтогоМасса.ПутьКДанным = "бит_ИтогоМассаКг";
	ПолеИтогоМасса.Заголовок = "Итого масса, кг";
	ПолеИтогоМасса.ТолькоПросмотр = Истина;
	
	ПолеИтогоОбъем = Элементы.Добавить("бит_ИтогоОбъемМ3", Тип("ПолеФормы"), ГруппаИтогов);
	ПолеИтогоОбъем.ПутьКДанным = "бит_ИтогоОбъемМ3";
	ПолеИтогоОбъем.Заголовок = "Итого объем, м3";
	ПолеИтогоОбъем.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура бит_ДобавитьКолонкуСтруктурыХраненияУпаковок(Таблица, Имя, ПутьКДанным, Заголовок)
	
	Колонка = Элементы.Добавить(Имя, Тип("ПолеФормы"), Таблица);
	Колонка.Вид = ВидПоляФормы.ПолеВвода;
	Колонка.ПутьКДанным = ПутьКДанным;
	Колонка.Заголовок = Заголовок;
	Колонка.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура бит_ОбновитьСтруктурыХраненияУпаковокНаСервере()
	// {{ПервыйБИТ ЛистТребований [исправление]  [VUVaynula@1cbit.ru] [30.06.2026 23:49:29] +        
	УстановитьПривилегированныйРежим(Истина);
	// }}ПервыйБИТ ЛистТребований [исправление]  [VUVaynula@1cbit.ru] [30.06.2026 23:49:29] -
	Если Элементы.Найти("бит_СтруктурыХраненияУпаковок") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма["бит_СтруктурыХраненияУпаковок"].Очистить();
	ЭтаФорма["бит_ИтогоМассаКг"] = 0;
	ЭтаФорма["бит_ИтогоОбъемМ3"] = 0;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Структуры.НомерУпаковки КАК НомерУпаковки,
	|	Структуры.ВсегоУпаковок КАК ВсегоУпаковок,
	|	Структуры.СодержимоеУпаковкиПФ КАК СодержимоеУпаковкиПФ,
	|	Структуры.ДлинаМм КАК ДлинаМм,
	|	Структуры.ШиринаМм КАК ШиринаМм,
	|	Структуры.ВысотаМм КАК ВысотаМм,
	|	Структуры.МассаКг КАК МассаКг,
	|	Структуры.ОбъемМ3 КАК ОбъемМ3
	|ИЗ
	|	РегистрСведений.бит_СтруктурыХраненияУпаковок КАК Структуры
	|ГДЕ
	|	Структуры.Номенклатура = &Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	НомерУпаковки");
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ЭтаФорма["бит_СтруктурыХраненияУпаковок"].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		ЭтаФорма["бит_ИтогоМассаКг"] = ЭтаФорма["бит_ИтогоМассаКг"] + Выборка.МассаКг;
		ЭтаФорма["бит_ИтогоОбъемМ3"] = ЭтаФорма["бит_ИтогоОбъемМ3"] + Выборка.ОбъемМ3;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОбновитьСтруктурыХраненияУпаковок(Команда)
	бит_ОбновитьСтруктурыХраненияУпаковокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура бит_СоздатьСтруктуруХраненияУпаковок(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед созданием структуры хранения необходимо записать номенклатуру.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Номенклатура", Объект.Ссылка);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("бит_СтруктураХраненияУпаковокПриЗакрытии", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.бит_СтруктурыХраненияУпаковок.Форма.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ИзменитьСтруктуруХраненияУпаковок(Команда)
	
	ТекущиеДанные = Элементы.бит_СтруктурыХраненияУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Выберите запись структуры хранения упаковок.");
		Возврат;
	КонецЕсли;
	
	КлючЗаписи = бит_КлючЗаписиСтруктурыХраненияУпаковок(ТекущиеДанные.НомерУпаковки, ТекущиеДанные.ВсегоУпаковок);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("бит_СтруктураХраненияУпаковокПриЗакрытии", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.бит_СтруктурыХраненияУпаковок.Форма.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаСервере
Функция бит_КлючЗаписиСтруктурыХраненияУпаковок(НомерУпаковки, ВсегоУпаковок)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Номенклатура", Объект.Ссылка);
	ЗначенияКлюча.Вставить("НомерУпаковки", НомерУпаковки);
	ЗначенияКлюча.Вставить("ВсегоУпаковок", ВсегоУпаковок);
	
	Возврат РегистрыСведений.бит_СтруктурыХраненияУпаковок.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

&НаКлиенте
Процедура бит_СтруктураХраненияУпаковокПриЗакрытии(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	бит_ОбновитьСтруктурыХраненияУпаковокНаСервере();
	
КонецПроцедуры
